In [123]:
import pandas as pd
from IPython.display import display

In [124]:
entrants=pd.read_csv('2017_Bibs_Rotg v3.csv')

entrants.head()

     No. First name Last name  Gender         City/Town State   Age
0  101.0      Chris     Abowd  Female          Glenmont    NY  53.0
1  102.0        Tom     Adams    Male       Schenectady    NY  72.0
2  103.0  Katherine  Ambrosio  Female            Delmar    NY  66.0
3  104.0       Gabe  Anderson    Male  Saratoga Springs    NY  39.0
4  105.0      Jacob   Andrews    Male              Troy    NY  23.0

In [125]:
entrants['fname']=entrants['First name']+" "+entrants['Last name']

In [126]:
entrants.head()

,No.,First name,Last name,Gender,City/Town,State,Age,fname
0,101.0,Chris,Abowd,Female,Glenmont,NY,53.0,Chris Abowd
1,102.0,Tom,Adams,Male,Schenectady,NY,72.0,Tom Adams
2,103.0,Katherine,Ambrosio,Female,Delmar,NY,66.0,Katherine Ambrosio
3,104.0,Gabe,Anderson,Male,Saratoga Springs,NY,39.0,Gabe Anderson
4,105.0,Jacob,Andrews,Male,Troy,NY,23.0,Jacob Andrews

In [127]:
entrants[entrants['fname']=='John Noonan']

       No. First name Last name Gender     City/Town State   Age        fname
196  297.0       John    Noonan   Male  Ballston Spa    NY  57.0  John Noonan

In [128]:
teams=pd.read_csv('teams.csv')
teams=teams.fillna(' ')
teams.head()

,Team Name,Open Male,Open Female,Agegraded1,Agegraded2,Extra 1,Extra 2
0,Noonan_Team,Shaun Donegan,Meghan Louden,John Noonan,Stephanie Landy,,
1,Team Loco,Joseph Sullivan,Kelly Sullivan,Steven Nicoll,Sara Madden,,
2,WillowStreetAC1,Matt Brooker,Mollie Turner,Derrick Staley,Beth Stalker,Janne Rand,
3,WillowStreetAC2,Dan Jordy,Hannah Brooker,Nancy Nicholson,Colleen Ottalagano-McGarry,Elizabeth Chauhan,Kari Deer
4,WillowStreetAC3,John Stadtlander,Erin Lopez,Lori Kingsley,Danielle Maslowsky,Chuck Terry,

In [129]:
for index, team in teams.iterrows():
    for i in range(1,6):
        #print team.iloc[i]
        if (team.iloc[i]!=' '):
            if (entrants[entrants.fname==team.iloc[i]].shape[0]==0):
                print team.iloc[i]+" ERRROR!!!!!"

Chuck Terry ERRROR!!!!!
Cassandra Vega ERRROR!!!!!